<!-- dflook/terraform-github-actions {"workspace":"tofu-release","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"793154348516704162d2226f2fed23190bb860270c125bb6f942f48e7a039ce9","plan_job_ref":"Job Test plan target and replace #365 at https://github.com/dflook/terraform-github-actions/actions/runs/6645076683","plan_hash":"23b43879a64a2a332b0e80757d6aca7b7819e9951a66bbd9ca6e442e6d32ee6c","plan_text_format":"text","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __tofu-release__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
      ~ id          = "**********" -> (known after apply)
      ~ result      = "**********" -> (known after apply)
        # (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  ~ count   = "ABXOMycxRE" -> (known after apply)
  ~ foreach = "DkstOB6pzu" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #365](https://github.com/dflook/terraform-github-actions/actions/runs/6645076683)